# **TUGAS PANDAS**

---


Nama    : Rhendy Japelhendal Saragih Sumbayak

NIM     : 235150407111015

Setelah mengikuti workshop Numpy dan Pandas, tentunya kalian sudah mulai memahami hal-hal apa saja yang akan dilakukan oleh Data Scientist dengan Pandas. Sekarang, saatnya mengukur kemampuan kalian dari apa yang telah kalian dapatkan pada workshop sebelumnya.

**Deadline: Jumat, 21 Februari 2025**

## **Dataset**

Pada penugasan kali ini, dataset yang digunakan adalah dataset titanic.

In [38]:
# !wget https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv

!curl -O https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100 60302  100 60302    0     0   235k      0 --:--:-- --:--:-- --:--:--  237k

In [39]:
import pandas as pd

df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# **üìä Pandas Exercise: Titanic Dataset üö¢**

Selamat datang di latihan eksplorasi data menggunakan **Pandas**!  
Kita akan menggunakan dataset **Titanic** untuk menerapkan berbagai teknik analisis data seperti seleksi, agregasi, pengolahan nilai kosong, sorting, dan banyak lagi.  

---

## **üìå Soal 1: Menampilkan Informasi Dataset** üìù

Tampilkan **informasi umum** tentang dataset Titanic, termasuk:  
‚úÖ Jumlah baris dan kolom  
‚úÖ Tipe data setiap kolom  
‚úÖ Jumlah nilai yang hilang dalam dataset

In [40]:
import pandas as pd

# Menampilkan informasi umum tentang dataset
print("Informasi Umum Dataset Titanic:")
print("===================================")
print(f"Jumlah Baris dan Kolom: {df.shape}")
print("\nTipe Data Setiap Kolom:")
print(df.dtypes)
print("\nJumlah Nilai yang Hilang:")
print(df.isnull().sum())

Informasi Umum Dataset Titanic:
===================================
Jumlah Baris dan Kolom: (891, 12)

Tipe Data Setiap Kolom:
PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

Jumlah Nilai yang Hilang:
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## **üìå Soal 2: Menampilkan Ringkasan Statistik** üìä  

### **Penjelasan:**  
Ringkasan statistik membantu kita memahami distribusi data dalam dataset.  
Coba tampilkan informasi seperti:  
- **Rata-rata, min, max, standar deviasi**  
- **Persentil (25%, 50%, 75%)**, yang menunjukkan distribusi data

In [41]:
# Menampilkan ringkasan statistik untuk kolom numerik
print("Ringkasan Statistik Dataset Titanic:")
print("=====================================")
print(df.describe())

Ringkasan Statistik Dataset Titanic:
=====================================
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

## **üìå Soal 3: Seleksi Data** üéØ  

### **Penjelasan:**  
Sering kali kita ingin **menyaring data** berdasarkan kondisi tertentu.  
Misalnya, kita ingin melihat hanya penumpang **perempuan** yang masih **anak-anak** dan dengan fare pada kondisi tertentu.  
Dengan **Boolean Indexing**, kita bisa memilih data berdasarkan kondisi seperti:  
- **`Hanya menampilkan penumpang perempuan  `** 
- **`Hanya menampilkan anak-anak  `**
- **`Hanya menampilkan Fare lebih dari 10 dan kurang dari sama dengan 30`**   
- **`Hanya menampilkan sepuluh teratas`**

In [42]:
# 1Ô∏è‚É£ Menampilkan hanya penumpang perempuan
female_passengers = df[df['Sex'] == 'female']

# 2Ô∏è‚É£ Menampilkan hanya anak-anak (usia di bawah 18)
children = df[df['Age'] < 18]

# 3Ô∏è‚É£ Menampilkan hanya penumpang dengan Fare lebih dari 10 dan kurang dari sama dengan 30
fare_range = df[(df['Fare'] > 10) & (df['Fare'] <= 30)]

# 4Ô∏è‚É£ Menampilkan sepuluh teratas berdasarkan Fare tertinggi
top_10_fare = df.nlargest(10, 'Fare')

# Menampilkan hasil seleksi
print("Penumpang Perempuan:")
female_passengers.head()

Penumpang Perempuan:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [43]:
print("Anak-anak (usia di bawah 18):")
children.head()

Anak-anak (usia di bawah 18):

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q

In [44]:
print("Penumpang dengan Fare lebih dari 10 dan kurang dari sama dengan 30:")
fare_range.head()

Penumpang dengan Fare lebih dari 10 dan kurang dari sama dengan 30:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S

In [45]:
print("Sepuluh Penumpang dengan Fare Tertinggi:")
top_10_fare[['Name', 'Fare']].head()

Sepuluh Penumpang dengan Fare Tertinggi:

                                   Name      Fare
258                    Ward, Miss. Anna  512.3292
679  Cardeza, Mr. Thomas Drake Martinez  512.3292
737              Lesurer, Mr. Gustave J  512.3292
27       Fortune, Mr. Charles Alexander  263.0000
88           Fortune, Miss. Mabel Helen  263.0000

## **üìå Soal 4: Menghitung Jumlah Nilai Unik** üî¢  

### **Penjelasan:**  
Terkadang kita perlu mengetahui **jumlah kategori unik** dalam suatu kolom.  
Misalnya, di dataset Titanic, kita ingin tahu:  
- **Berapa kelas tiket (`Pclass`) yang tersedia?**  
- **Berapa pelabuhan keberangkatan (`Embarked`) yang digunakan?**

In [46]:
# 1Ô∏è‚É£ Menghitung jumlah nilai unik pada kolom 'Pclass' (kelas tiket)
unique_pclass = df['Pclass'].nunique()

# 2Ô∏è‚É£ Menghitung jumlah nilai unik pada kolom 'Embarked' (pelabuhan keberangkatan)
unique_embarked = df['Embarked'].nunique()

# Menampilkan hasil
print(f"Jumlah kelas tiket (Pclass) yang tersedia: {unique_pclass}")
print(f"Jumlah pelabuhan keberangkatan (Embarked) yang digunakan: {unique_embarked}")

Jumlah kelas tiket (Pclass) yang tersedia: 3
Jumlah pelabuhan keberangkatan (Embarked) yang digunakan: 3

## **üìå Soal 5: Menampilkan Jumlah Penumpang dalam Setiap Kelas** üéüÔ∏è  

### **Penjelasan:**  
Hitung jumlah **penumpang** berdasarkan **kelas tiket**.  
Coba lihat distribusi penumpang di masing-masing kelas!

In [47]:
# Menghitung jumlah penumpang berdasarkan kelas tiket (Pclass)
passenger_count_by_class = df['Pclass'].value_counts()

# Menampilkan jumlah penumpang di setiap kelas tiket
print("Jumlah Penumpang di Setiap Kelas Tiket:")
passenger_count_by_class

Jumlah Penumpang di Setiap Kelas Tiket:

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

## **üìå Soal 6: Mengelompokkan Data Berdasarkan Kelas Tiket** üéüÔ∏è  

### **Penjelasan:**  
Kelompokkan data berdasarkan **kelas tiket**, lalu cari tahu:  
- **Rata-rata usia penumpang di setiap kelas**
- **Jumlah orang yang bertahan hidup**

In [48]:
# Mengelompokkan data berdasarkan kelas tiket (Pclass)
grouped_by_class = df.groupby('Pclass')

# 1Ô∏è‚É£ Rata-rata usia penumpang di setiap kelas tiket
average_age_by_class = grouped_by_class['Age'].mean()

# 2Ô∏è‚É£ Jumlah orang yang bertahan hidup di setiap kelas tiket
survival_count_by_class = grouped_by_class['Survived'].sum()

# Menampilkan hasil
print("Rata-rata Usia Penumpang di Setiap Kelas Tiket:")
print(average_age_by_class, "\n")

print("Jumlah Orang yang Bertahan Hidup di Setiap Kelas Tiket:")
print(survival_count_by_class)

Rata-rata Usia Penumpang di Setiap Kelas Tiket:
Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

Jumlah Orang yang Bertahan Hidup di Setiap Kelas Tiket:
Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

## **üìå Soal 7: Menambahkan Kolom Baru Berdasarkan Kategori Usia** üè∑Ô∏è  

### **Penjelasan:**  
Buatlah kolom baru bernama **"Age Category"**, dengan ketentuan berikut:  
- **"Child"** jika umur di bawah 18  
- **"Adult"** jika umur 18 ke atas

In [49]:
# Menambahkan kolom "Age Category" berdasarkan usia
df['Age Category'] = df['Age'].apply(lambda x: 'Child' if x < 18 else 'Adult')

# Menampilkan beberapa baris pertama untuk melihat kolom baru
df[['Age', 'Age Category']].head()

    Age Age Category
0  22.0        Adult
1  38.0        Adult
2  26.0        Adult
3  35.0        Adult
4  35.0        Adult

## **üìå Soal 8: Menghapus Data Kosong** ‚ö†Ô∏è  

### **Penjelasan:**  
Hapus semua **baris** yang memiliki **nilai kosong pada kolom "Age"**.  
Kemudian, tampilkan jumlah baris setelah penghapusan.

In [50]:
# Menghapus baris yang memiliki nilai kosong pada kolom 'Age'
df_cleaned = df.dropna(subset=['Age'])

# Menampilkan jumlah baris setelah penghapusan
print(f"Jumlah baris setelah penghapusan: {df_cleaned.shape[0]}")

Jumlah baris setelah penghapusan: 714

## **üìå Soal 9: Sorting Data** üîΩüîº  

### **Penjelasan:**  
Urutkan dataset berdasarkan:  
- **"Fare" secara descending** (tertinggi ke terendah)  
- **"Age" secara ascending** (termuda ke tertua)

In [51]:
# Mengurutkan data berdasarkan "Fare" secara descending dan "Age" secara ascending
sorted_df = df.sort_values(by=['Fare', 'Age'], ascending=[False, True])

# Menampilkan beberapa baris pertama untuk melihat hasil sorting
sorted_df[['Fare', 'Age']].head()

         Fare   Age
258  512.3292  35.0
737  512.3292  35.0
679  512.3292  36.0
27   263.0000  19.0
88   263.0000  23.0

## **üìå Soal 10: Menyimpan DataFrame** üíæ  

### **Penjelasan:**  
Setelah data diolah, kita mungkin ingin **menyimpannya ke file** agar bisa digunakan nanti.  
Simpan dataset yang telah dibersihkan (tanpa nilai kosong pada "Age") ke dalam **file CSV**.

In [52]:
# Menyimpan DataFrame yang telah dibersihkan ke dalam file CSV
df_cleaned.to_csv('titanic_cleaned.csv', index=False)

# Menampilkan pesan bahwa file telah disimpan
print("Dataset telah disimpan sebagai 'titanic_cleaned.csv'")

Dataset telah disimpan sebagai 'titanic_cleaned.csv'

# **üéØ Conclusion**  

Awesome job! üéâ You‚Äôve explored and analyzed the **Titanic dataset** using **Pandas**.  
Keep digging deeper, because there‚Äôs always more to discover! üöÄüìä  

> **"Data is like a chest in Minecraft‚Äîsometimes it‚Äôs full of treasure, sometimes it‚Äôs just dirt."** ‚õèÔ∏èüòÜ